Samraksh/eMote/MicroFrameworkPK_v4_3/DeviceCode/Targets/Native/STM32F10x/DeviceCode/drivers/radio/SI4468/si4468_driver.cpp
static bool is_radio_asleep(void) {
	return (si446x_request_device_state_shadow() == SI_STATE_SLEEP);
}

// This is a WLN specific feature and a no-op otherwise
static void set_radio_power_pwm(int go) {
#if defined(PLATFORM_ARM_WLN)
	if (go)
		GPIO_WriteBit(GPIOB, GPIO_Pin_9, Bit_SET);
	else
		GPIO_WriteBit(GPIOB, GPIO_Pin_9, Bit_RESET);
#else
	return;
#endif
}

// Only support Austere and WLN. "WLN Half board" and DOT pin configs were prototype only.
// If you want to use an older (non-platform) pin config, hack it in here.
static int pin_config(void) {
#if defined(PLATFORM_ARM_AUSTERE)
	if (SI446X_pin_setup == NULL) {
		SI446X_pin_setup = &si446x_pin_config_austere;
		si446x_debug_print(DEBUG03, "SI446X: Using Austere V1 Hardware Config\r\n");
	}
	return RADIO_PLATFORM_AUSTERE;
#elif defined(PLATFORM_ARM_WLN)
	if (SI446X_pin_setup == NULL) {
		SI446X_pin_setup = &si446x_pin_config_wln;
		GPIO_InitTypeDef GPIO_InitStructure;
		GPIO_InitStructure.GPIO_Speed = GPIO_Speed_10MHz;
		GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
		GPIO_InitStructure.GPIO_Pin =  GPIO_Pin_9;
		GPIO_Init(GPIOB, &GPIO_InitStructure);
		set_radio_power_pwm(0);
		si446x_debug_print(DEBUG03, "SI446X: Using WWF Hardware Config\r\n");
	}
	return RADIO_PLATFORM_WLN;
#else
#error "SI446X: Unknown pin configuration"
	//si446x_debug_print(ERR99, "SI446X: Unknown hardware platform, pin config will probably fail\r\n");
	return RADIO_PLATFORM_UNKNOWN;
#endif
}

radio_state_t si446x_hal_get_state() {
	si_state_t state = si446x_request_device_state_shadow();
	//si446x_debug_print(DEBUG02,"%s\r\n", __func__);

	switch(state) {
		case SI_STATE_OFF: 		return STATE_OFF;
		case SI_STATE_SLEEP: 	return STATE_SLEEP;
		case SI_STATE_SPI_ACTIVE:
		case SI_STATE_READY:
		case SI_STATE_READY2: 	return STATE_IDLE;
		case SI_STATE_TX_TUNE:
		case SI_STATE_TX: 		return STATE_TX;
		case SI_STATE_RX_TUNE:
		case SI_STATE_RX: 		return STATE_RX;
		case SI_STATE_ERROR:
		case SI_STATE_UNKNOWN: 	return STATE_ERROR;
		case SI_STATE_BOOT: 	return STATE_BUSY;
		default: 				return STATE_BUSY;
	}
}

DeviceStatus si446x_hal_set_state(radio_state_t next) {
	DeviceStatus ret = DS_Fail;
	int status;
	radio_state_t curr = si446x_hal_get_state();
	si446x_debug_print(DEBUG02,"%s : Curr=%d next=%d\r\n", __func__, rs_tostring(curr), rs_tostring(next));
	
	// Allowed transitions:
	// OFF to IDLE
	// IDLE to RX
	// IDLE to OFF
	// Change to BUSY never allowed
	// SLEEP to RX
	// SLEEP to OFF
	// SLEEP to IDLE
	// TODO: FINISH ME
	
	if (curr == next) return DS_Success;
	
	// OFF state is special because power may take some time to turn on
	if (curr == STATE_OFF) { // Supports: IDLE
		int status = platform_radio_pwr_ctrl(TURN_RADIO_ON, THIS_RADIO);
		ret = (status) ? DS_Fail : DS_Success;
	}
	return ret;
}

DeviceStatus si446x_hal_init(RadioEventHandler *event_handler, UINT8 radio, UINT8 mac_id) {

	DeviceStatus ret = DS_Success;
	int reset_errors;
	uint8_t temp;
	radio_lock_id_t owner;
	
	if (isInit) return DS_Bug;

	// Set up debugging output
	si446x_set_debug_print(si446x_debug_print, si4468x_debug_level);
	si446x_debug_print(DEBUG02, "SI446X: si446x_hal_init()\r\n");

	if ( owner = si446x_spi_lock(radio_lock_init) ) {
		si446x_debug_print(DEBUG02, "SI446X: si446x_hal_init() FAIL, SPI busy: %s\r\n", print_lock(owner));
		return DS_Fail;
	}

	pin_config();

	// Default settings
	si446x_channel = si446x_default_channel;
	tx_power = si446x_default_power;
	tx_msg_ptr = &tx_msg;
	rx_msg_ptr = &rx_msg;
	init_radio_SPI();
	init_si446x_pins();

	si446x_reset();
	reset_errors  = si446x_part_info();
	reset_errors += si446x_func_info();

	if ( reset_errors ) {
		ret = DS_Fail;
		si446x_debug_print(ERR100, "SI446X: si446x_hal_init(): reset failed.\r\n");
		goto si446x_hal_init_CLEANUP;
	}

	isInit = 1;

	si446x_get_int_status(0x0, 0x0, 0x0); // Saves status and clears all interrupts
	si446x_request_device_state();
	si446x_debug_print(DEBUG01, "SI446X: Radio Interrupts Cleared\r\n");

	temp = si446x_get_property(0x00, 0x01, 0x03);
	if (temp != RF_GLOBAL_CONFIG_1_1) {
		si446x_debug_print(DEBUG01, "SI446X: si446x_hal_init GLOBAL_CONFIG Setting Looks Wrong... Overriding...\r\n");
		si446x_set_property( 0x00, 0x01, 0x03, RF_GLOBAL_CONFIG_1_1 );
	}

	temp = si446x_get_property(0x12, 0x01, 0x08);
	if (temp != PKT_LEN) {
		si446x_debug_print(DEBUG01, "SI446X: si446x_hal_init PKT_LEN Setting Looks Wrong...Overriding...\r\n");
		si446x_set_property( 0x12, 0x01, 0x08, PKT_LEN );
	}

	temp = si446x_get_property(0x12, 0x01, 0x12);
	if (temp != PKT_FIELD_2_LENGTH) {
		si446x_debug_print(DEBUG01, "SI446X: si446x_hal_init PKT_FIELD_2_LENGTH Setting Looks Wrong...Overriding...\r\n");
		si446x_set_property( 0x12, 0x01, 0x12, PKT_FIELD_2_LENGTH );
	}

	si446x_fifo_info(0x3); // Reset both FIFOs. bit1 RX, bit0 TX
	si446x_debug_print(DEBUG01, "SI446X: Radio RX/TX FIFOs Cleared\r\n");

	// Set MAC datastructures
	active_mac_index = radio_si446x_spi2.GetMacIdIndex();
	if(radio_si446x_spi2.Initialize(event_handler, mac_id) != DS_Success) {
		ret = DS_Fail;
		si446x_debug_print(ERR100, "SI446X: si446x_hal_init(): MAC init failed.\r\n");
		goto si446x_hal_init_CLEANUP;
	}

	{
		//Get cpu serial and hash it to use as node id. THIS IS NOT A DRIVER FUNCTION. MOVE TO MAC LAYER.
		UINT8 cpuserial[serial_size];
		memset(cpuserial, 0, serial_size);
		GetCPUSerial(cpuserial, serial_size);
		UINT16 tempNum=0;
		UINT16 * temp = (UINT16 *) cpuserial;
		for (int i=0; i< 6; i++){
			tempNum=tempNum ^ temp[i]; //XOR 72-bit number to generate 16-bit hash
		}
		radio_si446x_spi2.SetAddress(tempNum);
		si446x_debug_print(DEBUG02, "SI446X: CPU Serial Hash: 0x%.4X\r\n", tempNum);
	}

	// Init Continuations and interrupts
	// Leave these last in case something above fails.
	CPU_GPIO_EnableInputPin( SI446X_pin_setup->nirq_mf_pin, FALSE, si446x_spi2_handle_interrupt, GPIO_INT_EDGE_LOW, RESISTOR_DISABLED);
	tx_callback_continuation.InitializeCallback(tx_cont_do, NULL);
	rx_callback_continuation.InitializeCallback(rx_cont_do, NULL);
	int_defer_continuation.InitializeCallback(int_cont_do, NULL);

	// Power system callbacks
	state_callback_continuation.InitializeCallback(state_cont_do, NULL);
	platform_power_event_sub(&state_callback_continuation);

si446x_hal_init_CLEANUP:

