Samraksh/eMote/MicroFrameworkPK_v4_3/DeviceCode/Targets/Native/STM32F10x/DeviceCode/drivers/radio/SI4468/si4468_driver.cpp
		si446x_write_tx_fifo(4, (uint8_t*)&eventOffset); // generate and write timestamp late as possible.

		if(SI4468_Radio_TX_Instance != DISABLED_PIN ){
			//CPU_GPIO_SetPinState( SI4468_Radio_TX_Instance, !CPU_GPIO_GetPinState(SI4468_Radio_TX_Instance) );
			//CPU_GPIO_SetPinState( SI4468_Radio_TX_Instance, !CPU_GPIO_GetPinState(SI4468_Radio_TX_Instance) );
		}
		si446x_start_tx(chan, after_state, tx_buf[0]+1);
		irq.Release();
	} else { // Normal Case
		if(SI4468_Radio_TX_Instance_NOTS != DISABLED_PIN ){
			//CPU_GPIO_SetPinState( SI4468_Radio_TX_Instance_NOTS, !CPU_GPIO_GetPinState(SI4468_Radio_TX_Instance_NOTS) );
			//CPU_GPIO_SetPinState( SI4468_Radio_TX_Instance_NOTS, !CPU_GPIO_GetPinState(SI4468_Radio_TX_Instance_NOTS) );
		}
		si446x_start_tx(chan, after_state, tx_buf[0]+1);
	}

	si446x_spi_unlock();
	// RADIO STAYS LOCKED UNTIL TX DONE

	return DS_Success;
}

void *si446x_hal_send(UINT8 radioID, void *msg, UINT16 size) {
	//CPU_GPIO_SetPinState( SI4468_TX, TRUE );
	si446x_debug_print(DEBUG01, "SI446X: si446x_hal_send()\r\n");

	DeviceStatus ret;

	// Do the send
	ret = si446x_packet_send(si446x_channel, (uint8_t *) msg, size, 0, NO_TIMESTAMP, SI446x_TX_DONE_STATE);
	if (ret != DS_Success) {
		SendAckFuncPtrType AckHandler = radio_si446x_spi2.GetMacHandler(active_mac_index)->GetSendAckHandler();
		switch (ret) {
			case DS_Busy: 	(*AckHandler)(tx_msg_ptr, size, NetworkOperations_Busy, SI_DUMMY);			break;
			case DS_Timeout:(*AckHandler)(tx_msg_ptr, size, NetworkOperations_BadPacket, SI_DUMMY); 	break;
			default:		(*AckHandler)(tx_msg_ptr, size, NetworkOperations_Fail, SI_DUMMY); 		break;
		}
		return msg;
	}

	// exchange bags.
	Message_15_4_t* temp = tx_msg_ptr;
	tx_msg_ptr = (Message_15_4_t*) msg;

	//CPU_GPIO_SetPinState( SI4468_TX, FALSE );
	return msg;
}

void *si446x_hal_send_ts(UINT8 radioID, void *msg, UINT16 size, UINT32 eventTime) {

	//CPU_GPIO_SetPinState( SI4468_TX_TIMESTAMP, TRUE );

	si446x_debug_print(DEBUG01, "SI446X: si446x_hal_send_ts()\r\n");

	DeviceStatus ret;

	// Do the send
	ret = si446x_packet_send(si446x_channel, (uint8_t *) msg, size, eventTime, YES_TIMESTAMP, SI446x_TX_DONE_STATE);
	if (ret != DS_Success) {
		SendAckFuncPtrType AckHandler = radio_si446x_spi2.GetMacHandler(active_mac_index)->GetSendAckHandler();
		switch (ret) {
			case DS_Busy: 	(*AckHandler)(tx_msg_ptr, size, NetworkOperations_Busy, SI_DUMMY);			break;
			case DS_Timeout:(*AckHandler)(tx_msg_ptr, size, NetworkOperations_BadPacket, SI_DUMMY);	break;
			default:		(*AckHandler)(tx_msg_ptr, size, NetworkOperations_Fail, SI_DUMMY);			break;
		}
		return msg;
	}

	// exchange bags.
	Message_15_4_t* temp = tx_msg_ptr;
	tx_msg_ptr = (Message_15_4_t*) msg;

	//CPU_GPIO_SetPinState( SI4468_TX_TIMESTAMP, FALSE );
	return msg;
}

#ifdef SI446X_DEBUG_UNFINISHED_PKT
// ASSUMES YOU HOLD SPI LOCK
static bool rx_consistency_check(void) {
	GLOBAL_LOCK(irq); // lock while debugging only. Change me.

	// If the radio lock is held by RX
	// We must be in either RX mode or the continuation is pending
	// or an interrupt is pending
	if ( radio_lock == radio_lock_rx ) {
		si_state_t state = si446x_request_device_state();
		//bool isBusy = (cont_busy() || radio_get_assert_irq());
		si446x_get_int_status(0xFF, 0xFF, 0xFF);
		bool isBusy = cont_busy() || si446x_get_ph_pend() || si446x_get_modem_pend();

		if (state != SI_STATE_RX && !isBusy) {
			si446x_debug_print(ERR100, "SI446X: rx_consistency_check() Fail? Show Nathan.\r\n");
			return false;
		}

		// check for timeout of SYNC_DET
		UINT64 now = HAL_Time_CurrentTicks();
		if ( (now - rx_timestamp) > (si446x_rx_timeout_ms*8000) ) {
			si446x_debug_print(ERR100, "SI446X: rx_consistency_check() Timeout? Show Nathan.\r\n");
			return false;
		}
	}
	return true;
}
#endif // #ifdef SI446X_DEBUG_UNFINISHED_PKT

// Does NOT set the radio busy unless a packet comes in.
DeviceStatus si446x_hal_rx(UINT8 radioID) {
	//CPU_GPIO_SetPinState( SI4468_Radio_STATE, TRUE );
	radio_lock_id_t owner;
	si446x_debug_print(DEBUG02, "SI446X: si446x_hal_rx()\r\n");

	if (!isInit) {
		si446x_debug_print(DEBUG01, "SI446X: si446x_hal_rx() FAIL. Not Init.\r\n");
		return DS_Fail;
	}

	SI446x_INT_MODE_CHECK();

	if ( cont_busy() ) {
		si446x_debug_print(DEBUG02, "SI446X: si446x_hal_rx() Tasks outstanding, aborting.\r\n");
		return DS_Fail;
	}

	if ( owner = si446x_spi_lock(radio_lock_rx_setup) ) {
		si446x_debug_print(DEBUG01, "SI446X: si446x_hal_rx() FAIL. SPI locked by %s\r\n", print_lock(owner));
		return DS_Busy;
	}

#ifdef SI446X_DEBUG_UNFINISHED_PKT
	// DEBUGGING ONLY
	rx_consistency_check();
#endif

	// We have to hold radio lock to ensure we are free
	if ( owner = si446x_radio_lock(radio_lock_rx_setup) ) {
		si446x_debug_print(DEBUG02, "SI446X: si446x_hal_rx() FAIL. Radio locked by owner: %s\r\n", print_lock(owner));
		si446x_spi_unlock();
		return DS_Busy;
	}

	si446x_get_int_status(0xFF, 0xFF, 0xFF);
	if ( radio_get_assert_irq() || cont_busy() || si446x_get_ph_pend() || si446x_get_modem_pend() ) {
		si446x_debug_print(DEBUG01, "SI446X: si446x_hal_rx() radio ops pending, aborting.\r\n");
		si446x_radio_unlock();
		si446x_spi_unlock();
		return DS_Busy;
	}

	// Now that we are sure we aren't busy, can unlock the radio.
	si446x_radio_unlock();

	si446x_start_rx_fast_channel(si446x_channel);
	si446x_spi_unlock();
	si446x_debug_print(DEBUG01, "SI446X: si446x_hal_rx() END\r\n");


	return DS_Success;
}


DeviceStatus si446x_hal_sleep(UINT8 radioID) {
	//CPU_GPIO_SetPinState( SI4468_HANDLE_SLEEP, TRUE );
	radio_lock_id_t owner;
	si446x_debug_print(DEBUG01, "SI446X: si446x_hal_sleep()\r\n");

	SI446x_INT_MODE_CHECK();

	if (!isInit) {
		si446x_debug_print(DEBUG02, "SI446X: si446x_hal_sleep() FAIL. No Init.\r\n");
		return DS_Fail;
	}

	// We were already asleep
	if ( si446x_request_device_state_shadow() == SI_STATE_SLEEP ) {
		return DS_Success;
	}

	if ( owner = si446x_spi_lock(radio_lock_sleep) ) {
		si446x_debug_print(ERR99, "SI446X: si446x_hal_sleep() FAIL. SPI locked. Owner is %s\r\n", print_lock(owner));
		//CPU_GPIO_SetPinState( SI4468_HANDLE_SLEEP, FALSE );
		//CPU_GPIO_SetPinState( SI4468_HANDLE_SLEEP, TRUE );
		//CPU_GPIO_SetPinState( SI4468_HANDLE_SLEEP, FALSE );
		return DS_Fail;
	}

	if ( owner = si446x_radio_lock(radio_lock_sleep) ) {
		si446x_debug_print(ERR99, "SI446X: si446x_hal_sleep() FAIL. Radio Busy. Owner is %s\r\n", print_lock(owner));
		//Radio complains that tx is not yet done
		//si446x_radio_unlock();
		si446x_spi_unlock();
		//CPU_GPIO_SetPinState( SI4468_HANDLE_SLEEP, FALSE );
		//CPU_GPIO_SetPinState( SI4468_HANDLE_SLEEP, TRUE );
		//CPU_GPIO_SetPinState( SI4468_HANDLE_SLEEP, FALSE );
		return DS_Fail;
	}

	if ( si446x_leave_rx(radio_lock_sleep) ) {
		si446x_debug_print(DEBUG02, "SI446X: si446x_hal_sleep() FAIL. Radio Busy.\r\n");
		si446x_radio_unlock();
		si446x_spi_unlock();
		return DS_Fail;
	}

	si446x_change_state(SI_STATE_SLEEP);
	si446x_radio_unlock();
	si446x_spi_unlock();

	//CPU_GPIO_SetPinState( SI4468_HANDLE_SLEEP, FALSE );
	//CPU_GPIO_SetPinState( SI4468_Radio_STATE, FALSE );
	return DS_Success;
}


DeviceStatus si446x_hal_tx_power(UINT8 radioID, int pwr) {
	radio_lock_id_t owner;
	si446x_debug_print(DEBUG02, "SI446X: si446x_hal_tx_power()\r\n");

	if (pwr < 0) return DS_Fail; // Not worth of a printf

	if ( owner = si446x_spi_lock(radio_lock_tx_power) ) {
		si446x_debug_print(DEBUG02, "SI446X: si446x_hal_tx_power() FAIL. SPI locked: %s\r\n", print_lock(owner));
		return DS_Fail;
	}

	if (!isInit) {
		si446x_debug_print(DEBUG02, "SI446X: si446x_hal_tx_power() FAIL. No Init.\r\n");
		si446x_spi_unlock();
		return DS_Fail;
	}

	if ( owner = si446x_radio_lock(radio_lock_tx_power) ) {
		si446x_debug_print(DEBUG02, "SI446X: si446x_hal_tx_power() FAIL. Radio locked: %s\r\n", print_lock(owner));
		si446x_spi_unlock();
		return DS_Fail;
	}

	si446x_debug_print(DEBUG03, "SI446X: si446x_hal_tx_power() setting raw power %d\r\n", (uint8_t)pwr);
	si446x_set_property( 0x22 , 1, 0x01, (uint8_t) pwr );
	tx_power = pwr;

