Samraksh/eMote/MicroFrameworkPK_v4_3/DeviceCode/Targets/Native/STM32F10x/DeviceCode/drivers/radio/SI4468/si4468_driver.cpp
	si446x_radio_unlock();
	si446x_spi_unlock();

	return DS_Success;
}

DeviceStatus si446x_hal_set_channel(UINT8 radioID, int channel) {
	radio_lock_id_t owner;
	si446x_debug_print(DEBUG02, "SI446X: si446x_hal_set_channel()\r\n");
	if (channel < 0 ) return DS_Fail;

	if ( owner = si446x_spi_lock(radio_lock_set_channel) ) {
		si446x_debug_print(DEBUG01, "SI446X: si446x_hal_set_channel() FAIL. SPI locked: %s\r\n", print_lock(owner));
		return DS_Fail;
	}

	if (!isInit) {
		si446x_debug_print(DEBUG02, "SI446X: si446x_hal_set_channel() FAIL. No Init.\r\n");
		si446x_spi_unlock();
		return DS_Fail;
	}

	if ( owner = si446x_radio_lock(radio_lock_set_channel) ) {
		si446x_debug_print(DEBUG01, "SI446X: si446x_hal_set_channel() FAIL. Radio Busy: %s\r\n", print_lock(owner));
		si446x_spi_unlock();
		return DS_Fail;
	}

	si446x_channel = channel;

	// Technically may not need the locks.
	// But could confuse the user otherwise.
	// And still at least protects the vars.
	si446x_radio_unlock();
	si446x_spi_unlock();

	return DS_Success;
}


// Doesn't belong in radio driver... --NPS
//Properties of radio
static INT8 radioType;
void si446x_hal_set_RadioType(INT8 radio)
{
	radioType = radio;
}

// Doesn't belong in radio driver...
INT8 si446x_hal_get_RadioType()
{
	return radioType;
}

// New CCA semantics after talking to Ananth + Bora
// CCA request is only valid if radio is already in RX, otherwise discard.
// Radio remains in RX after CCA. Packets that come in during CCA are discarded.
// Packets that come in atter CCA while still in RX are kept.
// NPS 2016-07-06
DeviceStatus si446x_hal_cca_ms(UINT8 radioID, UINT32 ms) {
	radio_lock_id_t owner;
	uint8_t int_enable;
	DeviceStatus ret;
	UINT64 now, now2;
	int adjusted_ms;
	const unsigned ticks_per_ms = 8000;

	now = HAL_Time_CurrentTicks();

	si446x_debug_print(DEBUG01, "SI446X: si446x_hal_cca_ms() ms:%d\r\n",ms);

	SI446x_INT_MODE_CHECK();

	if (!isInit) {
		si446x_debug_print(ERR99, "SI446X: si446x_hal_cca_ms() FAIL. No Init.\r\n");
		return DS_Fail;
	}

	if ( owner = si446x_spi_lock(radio_lock_cca_ms) ) {
		si446x_debug_print(DEBUG03, "SI446X: si446x_hal_cca_ms() FAIL. SPI locked: %s\r\n", print_lock(owner));
		return DS_Fail;
	}

	if ( owner = si446x_radio_lock(radio_lock_cca_ms) ) {
		si446x_debug_print(DEBUG03, "SI446X: si446x_hal_cca_ms() FAIL. Radio locked: %s\r\n", print_lock(owner));
		si446x_spi_unlock();
		return DS_Fail;
	}

	if ( cont_busy() ) {
		si446x_debug_print(DEBUG03, "SI446X: si446x_hal_cca_ms() FAIL. Continuation Pending.\r\n");
		si446x_radio_unlock();
		si446x_spi_unlock();
		return DS_Fail;
	}

	si_state_t state = si446x_request_device_state();
	if (state != SI_STATE_RX && state != SI_STATE_RX_TUNE) {
		si446x_debug_print(DEBUG03, "SI446X: si446x_hal_cca_ms() Radio not in RX. Abort CCA. State: %d\r\n", state);
		si446x_radio_unlock();
		si446x_spi_unlock();
		return DS_Fail;
	}

	// Allow to move from RX_TUNE to RX if needed.
	// TODO: Timeout
	while ( state == SI_STATE_RX_TUNE ) { state = si446x_request_device_state(); }

	// We don't keep/want packets for the duration of the CCA. Turn off interupts and kill FIFO afterwards.
	int_enable = si446x_get_property(0x01, 1, 0); 	// save interrupt mask
	si446x_set_property(0x01, 1, 0, 0); 			// mask all radio interrupts
	si446x_get_int_status(0xFF, 0xFF, 0xFF); 		// check interrupts final time

	// last abort chance
	if ( si446x_get_ph_pend() || si446x_get_modem_pend() ) {
		si446x_set_property(0x01, 1, 0, int_enable); 	// Unmask interrupts
		si446x_debug_print(DEBUG03, "SI446X: si446x_hal_cca_ms() Radio Busy.\r\n");
		si446x_radio_unlock();
		si446x_spi_unlock();
		return DS_Fail;
	}

	// We do NOT retain packets encountered during CCA.
	// Not using GLOBAL_LOCK here so YMMV with how accurate this timing is.
	now2 = HAL_Time_CurrentTicks();
	adjusted_ms = ms - ((now2-now) / ticks_per_ms) - 1;
	if(adjusted_ms > 0)
		HAL_Time_Sleep_MicroSeconds(adjusted_ms); 	// Wait specified period
	si446x_get_modem_status( 0xFF ); 				// Fetch results

	if (si446x_get_current_rssi() >= si446x_rssi_cca_thresh)
		ret = DS_Busy;
	else
		ret = DS_Success;

	si446x_leave_rx(radio_lock_cca_ms);

	si446x_get_int_status(0x0, 0x0, 0x0);	 		// Clear interrupts
	si446x_fifo_info(0x3);							// Clear FIFO
	si446x_set_property(0x01, 1, 0, int_enable);	// Unmask interrupts
	si446x_start_rx_fast_channel(si446x_channel);	// re-arm RX

	si446x_radio_unlock();
	si446x_spi_unlock();
	si446x_debug_print(DEBUG03, "SI446X: CCA complete, saw RSSI: %d dBm (raw %d) thresh: %d\r\n",
		convert_rssi(si446x_get_current_rssi()), si446x_get_current_rssi(), si446x_rssi_cca_thresh);
	return ret;
}

UINT32 si446x_hal_get_chan(UINT8 radioID) {
	si446x_debug_print(DEBUG01, "SI446X: si446x_hal_get_chan()\r\n");
	return si446x_channel;
}


UINT32 si446x_hal_get_power(UINT8 radioID) {
	si446x_debug_print(DEBUG01, "SI446X: si446x_hal_get_power()\r\n");
	return tx_power;
}

// Also possible to do this with FRR.
// Automatically saved each packet, don't need to bother radio or lock.
UINT32 si446x_hal_get_rssi(UINT8 radioID) {
	UINT32 ret = si446x_get_latched_rssi();
	si446x_debug_print(DEBUG02, "SI446X: si446x_hal_get_rssi() : %d\r\n", ret);
	return ret;
}

// INTERRUPT CONTEXT, LOCKED
static void si446x_pkt_tx_int() {
	si446x_debug_print(DEBUG01, "SI446X: si446x_pkt_tx_int()\r\n");
	set_radio_power_pwm(0); // TX done, idle power supply
	tx_callback_continuation.Enqueue();
}

// INTERRUPT CONTEXT. LOCKED, radio_busy until we pull from continuation
static void si446x_pkt_rx_int() {
	// radio_lock owned by SYNC_DET at this point
	si446x_debug_print(DEBUG01, "SI446X: si446x_pkt_rx_int()\r\n");
	rx_callback_continuation.Enqueue();
}

// ASSUMES SPI_LOCK IS HELD BY CALLER (INTERRUPT HANDLER)
// Interface spec is to just to drop the packet on the floor
static void si446x_pkt_bad_crc_int(void) {
	radio_lock_id_t owner 		= (radio_lock_id_t) spi_lock;
	radio_lock_id_t radio_owner = (radio_lock_id_t) radio_lock;

	if (owner != radio_lock_interrupt) {
		si446x_debug_print(ERR99, "SI446X: si446x_pkt_bad_crc_int() Bad spi_lock!, owner: %s\r\n", print_lock(owner));
		return;
	}

	if (radio_owner != radio_lock_rx) {
		si446x_debug_print(ERR99, "SI446X: si446x_pkt_bad_crc_int() Bad radio_lock!, owner: %s\r\n", print_lock(radio_owner));
		return;
	}

	si446x_debug_print(DEBUG01, "SI446X: si446x_pkt_bad_crc_int() Bad CRC. FIFOs cleared\r\n");
	si446x_fifo_info(0x3); 		// clear the FIFO
	// We lost the packet, so give up the radio
	si446x_radio_unlock();
}

// INTERRUPT CONTEXT
static void si446x_spi2_handle_interrupt(GPIO_PIN Pin, BOOL PinState, void* Param)
{
	uint8_t modem_pend, ph_pend;
	radio_lock_id_t owner;
	UINT64 int_ts;

	GLOBAL_LOCK(irq); // Locked due to time critical.
	int_ts = HAL_Time_CurrentTicks(); // Log RX time.
	irq.Release(); // Unlock after timestamp.

	if (Pin != SI446X_pin_setup->nirq_mf_pin) { return; }

	si446x_debug_print(DEBUG02, "SI446X: INT\r\n");

