Samraksh/eMote/MicroFrameworkPK_v4_3/DeviceCode/Targets/Native/STM32F10x/DeviceCode/drivers/radio/SI4468/si4468_driver.cpp
	if ( owner = si446x_spi_lock(radio_lock_interrupt) ) {
		// Damn, we got an interrupt in the middle of another transaction. Have to defer it.
		// Hope this doesn't happen much because will screw up timestamp.
		// TODO: Spend some effort to mitigate this if/when it happens.
		si446x_debug_print(ERR99, "SI446X: si446x_spi2_handle_interrupt() SPI locked: %s\r\n", print_lock(owner));
		int_defer_continuation.Enqueue();
		return;
	}

	si446x_get_int_status(0x0, 0x0, 0x0); // Saves status and clears all interrupts
	ph_pend			= si446x_get_ph_pend();
	modem_pend 		= si446x_get_modem_pend();

	// Only save timestamp if it was an RX event.
	// Unlock SPI after the potential radio_lock, so both don't glitch free.
	if (modem_pend & MODEM_MASK_SYNC_DETECT) {
		// Unconditional lock grab.
		owner = si446x_radio_lock_nofail(radio_lock_rx);
		if (owner != radio_lock_none && owner != radio_lock_tx)
			si446x_debug_print(ERR99, "SI446X: si446x_spi2_handle_interrupt() Odd radio_lock: %s\r\n", print_lock(owner));
		rx_timestamp = int_ts;
		(radio_si446x_spi2.GetMacHandler(active_mac_index)->GetRadioInterruptHandler())(StartOfReception, NULL);
	}

	if (ph_pend & PH_STATUS_MASK_PACKET_RX) 	{
		si446x_pkt_rx_int();
		if (!rx_callback_continuation.IsLinked()) {
			si446x_debug_print(ERR99, "SI446X: si446x_spi2_handle_interrupt() No RX cont linked???\r\n");
		}
	}

	if (ph_pend & PH_STATUS_MASK_PACKET_SENT) 	{ si446x_pkt_tx_int(); }
	if (ph_pend & PH_STATUS_MASK_CRC_ERROR) 	{
		si446x_pkt_bad_crc_int();
	}

	// If we finished a packet, go to sleep
	/*if ( (ph_pend & PH_STATUS_MASK_PACKET_RX) || (ph_pend & PH_STATUS_MASK_CRC_ERROR) ) {
		si446x_change_state(SI_STATE_SLEEP);
	}*/

	si446x_spi_unlock();
}
